Hi @dtm80,

I'm using latest version (1.19) and here the output of terraform plan, policies is listed.
Can you  share your main.tf?

```console
$ terraform plan -out test-policy
bigip_ltm_pool.mypool: Refreshing state... [id=/Common/test-pool]
bigip_ltm_policy.testpolicy: Refreshing state... [id=/Common/testpolicy]

Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_virtual_server.http will be created
  + resource "bigip_ltm_virtual_server" "http" {
      + default_persistence_profile    = (known after apply)
      + destination                    = "10.12.12.12"
      + fallback_persistence_profile   = (known after apply)
      + firewall_enforced_policy       = (known after apply)
      + id                             = (known after apply)
      + ip_protocol                    = "tcp"
      + mask                           = (known after apply)
      + name                           = "/Common/terraform_vs_http"
      + per_flow_request_access_policy = (known after apply)
      + policies                       = [
          + "/Common/testpolicy",
        ]
      + port                           = 80
      + profiles                       = [
          + "/Common/http",
        ]
      + snatpool                       = (known after apply)
      + source                         = (known after apply)
      + source_address_translation     = (known after apply)
      + source_port                    = (known after apply)
      + state                          = "enabled"
      + trafficmatching_criteria       = (known after apply)
      + translate_address              = "enabled"
      + translate_port                 = "enabled"
      + vlans_enabled                  = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

───────────────────────────────────────────────────────────────────────────────

Saved the plan to: test-policy

To perform exactly these actions, run the following command to apply:
    terraform apply "test-policy"
```